import json


fileUser = 'phrasesUser.json'
fileBot = 'phrasesBot.json'

userText = {'by': ["goodbye", "гудбай", "гуд бай", "до свидания", "пока", "прощай", "пока-пока", "до скорой встречи", "удачи", "бай-бай", "пока пока", "байбай", "бай бай", "by", "увидимся", "мне пора", "мне пора бежать", "я ушел", "ушел", "убежал", "я убежал", "хорошего дня", "всего хорошего", "мне надо идти", "надо идти", "будь здоров", "хорошего дня", "gjrf"],
     'hi': ["привет", "о привет", "о, привет", "доброе утро", "добрый день", "добрый вечер", "здравствуйте", "здравствуй", "здорово", "здорова", "hello", "hi", "привет", "здоровеньки", "давно не виделись", "morning", "ghbdtn"],
     'help': ["help", "помоги мне", "на помощь", "помощь", "подсказка", "справка", "хелп", "мне не понятно", "не понятно", "что делать", "gjvjom", "помощ"],
     'litr': ["литр", "литров", "литры", "л", "лит", "kbnh", "kbnhjd", "kbnhs", "kbn", "k"],
     'grad': ["градус", "градусов", "градусы", "г", "град", "gradecs", "gralec", "uhflecjd", "g"],
     'power': ["мощность", "мощ", "м", "vjoyjcnm", "v", "power"],
     'volume': ["объем", "об", "о", "j,]tv", "объём"],
     'temperature': ["температура", "темп", "т", "ntvgthfnehf", "ntvg", "temp"],
     'removable': ["бот", "мне", "пожалуйста", "спасибо", "не за что", "ладно", "мог", "бы", "не мог бы ты"]
     }

botText = {'help': """Для использования бота введите ему строку: "Литров a градусов b"
где a - это количество литров, а b - это градусы, которые не
могут быть мение 1 и более 97


Для рассчта ориентировочного времени закипания введите строку: 
"мощность P температура T объем V"
где P - мощность нагревателя
T - начальная температура жидкости
V - объем жидкости""",
     'hi': ["Привет, ", "Здорова, ", "Хаюшки, ", "Привет-привет, ", "Здравствуй, ", "Hi, "],
     'by': ["Пока, ", "Пока-пока, ", "До скорой встречи, ", "Буду скучать, ", "Буду ждать твоего возвращения, ", "By, "]}


with open(fileUser, 'w', encoding="utf-8") as f:
    json.dump(userText, f, ensure_ascii=False)

with open(fileBot, 'w', encoding="utf-8") as f:
     json.dump(botText, f, ensure_ascii=False)

print("OK")